export const SECTIONS = [
  {
    name: "About",
    content: [
      {
        question: "1. 프론트엔드 개발을 시작하게 된 계기는 무엇인가요?",
        answer:
          "인터랙티브한 웹과 유저들과의 의사소통 과정이 너무 재미있었습니다. 특히 내가 개발한 결과물이 즉시 눈에 보인다는 점이 매력적이었습니다. 어렸을 때부터 자급자족하며 무언가를 만드는 것을 좋아했는데, 이러한 점들이 프론트엔드 개발에서 크게 와닿았던 것 같습니다.",
      },
      {
        question: "2. 개발자로서 가장 중요하게 생각하는 가치는 무엇인가요?",
        answer:
          "가장 중요하게 생각하는 것은 사소한 디테일함입니다. 예를 들어, 예외처리나 사용자가 내가 의도한 대로 행동하게 만드는 UX 설계와 같은 부분들입니다. 또한, 단순히 코드를 많이 작성하는 것보다 고민하고 탐구하는 시간이 많을수록 더 좋은 코드가 나온다는 점을 경험했습니다. 이런 경험을 통해 중요한 것은 침착함과 디테일이라는 것을 깨달았습니다.",
      },
    ],
  },
  {
    name: "Experience",
    content: [
      {
        question: "1. 프론트엔드 실무 경험은 어떤 것이 있나요?",
        answer:
          "엘리스트랙 IoT 3기에서 프론트엔드 개발을 맡아 팀원들과 협업하여 사용자 친화적인 UI를 설계하고 구현한 경험이 있습니다. 이 과정에서 실시간 데이터 대시보드와 e-commerce를 제작하며 실무에서의 협업과 기술 활용 능력을 배웠습니다. 특히, 프로젝트 전반을 사용자 중심으로 설계하여 실질적인 사용자 피드백을 반영한 제품을 성공적으로 구현했습니다.",
      },
      {
        question: "2. 해커톤 경험은 무엇인가요?",
        answer:
          "Friendl AI 해커톤에 참가하여 팀원들과 함께 창의적인 아이디어를 구상하고 이를 구현하는 경험을 쌓았습니다. 이 과정에서 빠르게 문제를 정의하고 해결책을 도출하며, 제한된 시간 안에 프로젝트를 완성하는 협업 능력을 배양할 수 있었습니다. 특히, 사용자 관점에서 기능을 기획하고 개발한 경험은 이후 프로젝트에도 많은 영향을 주었습니다.",
      },
    ],
  },
  {
    name: "Study",
    content: [
      {
        question: "1. 자기계발을 위해 어떤 것들을 해왔나요?",
        answer:
          "지속적인 학습을 위해 스터디와 온라인 강의에 적극 참여하며, 새로운 기술을 접할 때는 메타인지 방식을 활용해 학습 효율을 높이고 있습니다. 피드백을 열린 마음으로 수용하며, 매 프로젝트에서 개선점을 발견하고 이를 반영하기 위해 노력합니다.",
      },
      {
        question: "2. 어떤 기술을 학습했나요?",
        answer:
          "JavaScript, TypeScript, React, Redux를 중심으로 한 프론트엔드 기술 스택을 학습했습니다. Node.js와 Firebase를 활용한 간단한 백엔드 개발 경험도 있으며, 최근에는 WebSocket과 상태 관리의 심화 개념을 학습하며 실시간 데이터 처리 능력을 강화하고 있습니다.",
      },
    ],
  },
];
